# GetStructuralSettings Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
StructuralSettings..::..GetStructuralSettings Method
StructuralSettings Class See Also
---
Obtains the StructuralSettings object for the specified project document.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static StructuralSettings GetStructuralSettings(
	Document doc
)
```

Visual Basic
---
```text
Public Shared Function GetStructuralSettings ( _
	doc As Document _
) As StructuralSettings
```

Visual C++
---
```text
public:
static StructuralSettings^ GetStructuralSettings(
	Document^ doc
)
```

# ### Parameters
doc
    Type: Autodesk.Revit.DB..::..Document A project document.
# ### Return Value
The StructuralSettings object.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace